import pandas as pd

# Нова база знань про види спорту
KB = {
    ("футбол", "перевага", "командна гра"),
    ("футбол", "недолік", "травми"),
    ("баскетбол", "перевага", "розвиток координації"),
    ("баскетбол", "недолік", "високі вимоги до фізичної підготовки"),
    ("плавання", "перевага", "вплив на всі групи м'язів"),
    ("плавання", "недолік", "можливість отримання травм"),
    ("теніс", "перевага", "покращення реакції"),
    ("теніс", "недолік", "потреба в спеціальному обладнанні"),
    ("волейбол", "перевага", "розвиток командних навичок"),
    ("волейбол", "недолік", "можливість травм колін"),
    ("йога", "перевага", "зниження стресу"),
    ("йога", "недолік", "потреба в часі для навчання"),
    ("бокс", "перевага", "покращення фізичної форми"),
    ("бокс", "недолік", "високий ризик травм"),
    ("катання на велосипеді", "перевага", "поліпшення витривалості"),
    ("катання на велосипеді", "недолік", "потреба в обладнанні"),
    ("гімнастика", "перевага", "покращення гнучкості"),
    ("гімнастика", "недолік", "високі вимоги до фізичної підготовки"),
}

df = pd.DataFrame(columns=["s", "p", "o"])
i = 0
for s, p, o in KB:
    df.loc[i] = {"s": s, "p": p, "o": o}
    i += 1

# Зберігаємо в CSV файл
df.to_csv('kb.csv', index=False)

# Читаємо дані з CSV файлу
df = pd.read_csv('kb.csv')
print(df)
